Функция ПолучитьСвойство(НазваниеРеквизита, ПринадлежностьНабора)
    Запрос                                              =   Новый Запрос("
                                                                        |ВЫБРАТЬ
                                                                        |   НабДР.Свойство
                                                                        |ИЗ
                                                                        |   Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеРеквизиты КАК НабДР
                                                                        |ГДЕ
                                                                        |   НабДР.Свойство.Заголовок = &НазваниеРеквизита
                                                                        |   И НабДР.Ссылка.Наименование = &НазваниеДокумента
                                                                        |");
    Запрос.УстановитьПараметр("НазваниеРеквизита", НазваниеРеквизита);
    Запрос.УстановитьПараметр("НазваниеДокумента", ПринадлежностьНабора);
    Результат                                           =   Запрос.Выполнить().Выбрать();
    Если
        Результат.Следующий()
    Тогда
        Возврат Результат.Свойство
    Иначе
        Возврат Неопределено;
    КонецЕсли;
КонецФункции

Процедура СохранитьДопРеквизит(МойОбъект, ИмяРеквизита, ЗначениеРеквизита) Экспорт
    ЭтоМойОбъект                                        =   МойОбъект.ПолучитьОбъект();
    Свойство                                            =   Ж_ext.ПолучитьСвойствоРеквизита(ИмяРеквизита, МойОбъект);
    //Проверяем наличие
    Для Каждого ДопРеквизит
    Из          ЭтоМойОбъект.ДополнительныеРеквизиты
    Цикл
        Если
            ДопРеквизит.Свойство = Свойство
        Тогда
            МойРеквизит                                 =   ДопРеквизит;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    //Добавляем, если отсутствует
    Если
        Не ЗначениеЗаполнено(МойРеквизит)
    Тогда
        МойРеквизит                                     =   ЭтоМойОбъект.ДополнительныеРеквизиты.Добавить();
        МойРеквизит.Свойство                            =   Свойство;
    КонецЕсли;
    //Устанавливаем значение в зависимости от типа
    //Для примитивных типов - напрямую
    Если
        Строка(МойРеквизит.Свойство.ТипЗначения) = "Строка"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Число"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Дата"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Булево"
    Тогда
        МойРеквизит.Значение                            =   ЗначениеРеквизита;
    //Для дополнительных значений
    ИначеЕсли
        МойРеквизит.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов")
    Тогда
        СвойствоРеквизита                               =   ПолучитьСвойство(ИмяРеквизита, МойОбъект.Метаданные().Имя);
        //Проверяем наличие по наименованию
        ЗапросН                                         =   Новый Запрос("
                                                            |ВЫБРАТЬ
                                                            |   ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
                                                            |ИЗ
                                                            |   Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
                                                            |ГДЕ
                                                            |   (ЗначенияСвойствОбъектов.ПолноеНаименование ПОДОБНО &ЗначениеРеквизита
                                                            |   ИЛИ ЗначенияСвойствОбъектов.Наименование ПОДОБНО &ЗначениеРеквизита)
                                                            |И  ЗначенияСвойствОбъектов.Владелец = &СвойствоРеквизита");
        //Проверяем наличие по полному наименованию
        ЗапросПН                                        =   Новый Запрос("
                                                            |ВЫБРАТЬ
                                                            |   ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
                                                            |ИЗ
                                                            |   Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
                                                            |ГДЕ
                                                            |   (ЗначенияСвойствОбъектов.ПолноеНаименование ПОДОБНО &ЗначениеРеквизита
                                                            |   ИЛИ ЗначенияСвойствОбъектов.Наименование ПОДОБНО &ЗначениеРеквизита)
                                                            |И  ЗначенияСвойствОбъектов.Владелец = &СвойствоРеквизита");
        ЗапросН.УстановитьПараметр("ЗначениеРеквизита"      , ЗначениеРеквизита);
        ЗапросН.УстановитьПараметр("СвойствоРеквизита"      , СвойствоРеквизита);
        ЗапросПН.УстановитьПараметр("ЗначениеРеквизита"     , ЗначениеРеквизита);
        ЗапросПН.УстановитьПараметр("СвойствоРеквизита"     , СвойствоРеквизита);
        РезультатЗапросаН                               =   ЗапросН.Выполнить().Выбрать();
        РезультатЗапросаПН                              =   ЗапросПН.Выполнить().Выбрать();
        Если
            РезультатЗапросаН.Следующий()
        Тогда
            МойТипЗначенияН                             =   РезультатЗапросаН.Ссылка;
        КонецЕсли;
        Если
            РезультатЗапросаПН.Следующий()
        Тогда
            МойТипЗначенияПН                            =   РезультатЗапросаПН.Ссылка;
        КонецЕсли;
        //Если дополнительного значения нет, то создаём его
        Если
            НЕ ЗначениеЗаполнено(МойТипЗначенияН)
        И   НЕ ЗначениеЗаполнено(МойТипЗначенияПН)
        Тогда
             МойТипЗначения                             =   Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
             МойТипЗначения.Наименование                =   ЗначениеРеквизита;
             МойТипЗначения.ПолноеНаименование          =   ЗначениеРеквизита;
             МойТипЗначения.Записать();
        Иначе
             МойТипЗначения                             =   ?(ЗначениеЗаполнено(МойТипЗначенияН), МойТипЗначенияН, МойТипЗначенияПН);
        КонецЕсли;
        МойРеквизит.Значение                            =   МойТипЗначения;
    КонецЕсли;
    ЭтоМойОбъект.Записать();
КонецПроцедуры

Функция ПолучитьСписокЗначенийДопРеквизита(ЗначениеОбъекта, НазваниеРеквизита) Экспорт
    Запрос                                              =   Новый Запрос("
                                                                        |ВЫБРАТЬ
                                                                        |   ЗначенияСвойствОбъектов.Наименование КАК Наименование,
                                                                        |   ЗначенияСвойствОбъектов.ПолноеНаименование КАК ПолноеНаименование,
                                                                        |   ЗначенияСвойствОбъектов.Владелец КАК Владелец
                                                                        |ИЗ
                                                                        |   Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
                                                                        |ГДЕ
                                                                        |   ЗначенияСвойствОбъектов.Владелец = &СвойствоРеквизита");
    Запрос.УстановитьПараметр("СвойствоРеквизита"       , ПолучитьСвойство(НазваниеРеквизита, ЗначениеОбъекта.Метаданные().Имя));
    Результат                                           =   Запрос.Выполнить().Выбрать();
    Ответ                                               =   Новый Массив;
    Пока
        Результат.Следующий()
    Цикл
        Если
            Не  ЗначениеЗаполнено(Результат.Наименование)
            И   ЗначениеЗаполнено(Результат.ПолноеНаименование)
        Тогда
            Ответ.Добавить(Результат.ПолноеНаименование);
        ИначеЕсли
            Не  ЗначениеЗаполнено(Результат.ПолноеНаименование)
            И   ЗначениеЗаполнено(Результат.Наименование)
        Тогда
            Ответ.Добавить(Результат.Наименование);
        ИначеЕсли
                ЗначениеЗаполнено(Результат.Наименование)
            И   ЗначениеЗаполнено(Результат.ПолноеНаименование)
        Тогда
            Ответ.Добавить(?(СтрДлина(Результат.ПолноеНаименование) >= СтрДлина(Результат.Наименование),
                            Результат.ПолноеНаименование,
                            Результат.Наименование));
        КонецЕсли;
    КонецЦикла;
    Возврат Ответ;
КонецФункции

Функция ПолучитьСвойствоРеквизита(МоёИмя, МойОбъект) Экспорт
    МойТипРеквизита                                     =   ПолучитьСвойство(МоёИмя, МойОбъект.Метаданные().Имя);
    Если
        НЕ ЗначениеЗаполнено(МойТипРеквизита)
    Тогда
        НовыйРеквизит                                   =   ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
        НовыйРеквизит.Имя                               =   МоёИмя;
        НовыйРеквизит.Заголовок                         =   МоёИмя;
        НовыйРеквизит.Наименование                      =   МоёИмя;
        НовыйРеквизит.Доступен                          =   Истина;
        НовыйРеквизит.Записать();
        МойТипРеквизита                                 =   НовыйРеквизит;
    КонецЕсли;
    Возврат МойТипРеквизита.Ссылка;
КонецФункции
