Процедура СохранитьДопРеквизит(МойОбъект, ИмяЭлемента, ЗначениеЭлемента) Экспорт
    ЭтоМойОбъект                                        =   МойОбъект.ПолучитьОбъект();
    Свойство                                            =   Ж_ext.ПолучитьСвойствоРеквизита(ИмяЭлемента, МойОбъект);
    //Проверяем наличие
    Для Каждого ДопРеквизит
    Из          ЭтоМойОбъект.ДополнительныеРеквизиты
    Цикл
        Если
            ДопРеквизит.Свойство = Свойство
        Тогда
            МойРеквизит                                 =   ДопРеквизит;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    //Добавляем, если отсутствует
    Если
        Не ЗначениеЗаполнено(МойРеквизит)
    Тогда
        МойРеквизит                                     =   ЭтоМойОбъект.ДополнительныеРеквизиты.Добавить();
        МойРеквизит.Свойство                            =   Свойство;
    КонецЕсли;
    //Устанавливаем значение в зависимости от типа
    //Для примитивных типов - напрямую
    Если
        Строка(МойРеквизит.Свойство.ТипЗначения) = "Строка"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Число"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Дата"
    Или Строка(МойРеквизит.Свойство.ТипЗначения) = "Булево"
    Тогда
        МойРеквизит.Значение                            =   ЗначениеЭлемента;
    //Для дополнительных значений
    ИначеЕсли
        МойРеквизит.Свойство.ТипЗначения = Новый ОписаниеТипов("СправочникСсылка.ЗначенияСвойствОбъектов")
    Тогда
        //Проверяем наличие по наименованию
        МойТипЗначенияН                                 =   Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ЗначениеЭлемента);
        //Проверяем наличие по полному наименованию
        Запрос                                          =   Новый Запрос("
                                                            |ВЫБРАТЬ
                                                            |   ЗначенияСвойствОбъектов.Ссылка КАК Ссылка
                                                            |ИЗ
                                                            |   Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
                                                            |ГДЕ
                                                            |   ЗначенияСвойствОбъектов.ПолноеНаименование ПОДОБНО &Значение
                                                            |И  ЗначенияСвойствОбъектов.Владелец.Ссылка В (
                                                            |           ВЫБРАТЬ
                                                            |               Хар.Ссылка КАК Ссылка
                                                            |           ИЗ
                                                            |               ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Хар
                                                            |           ГДЕ
                                                            |               Хар.Заголовок = &НазваниеРеквизита
                                                            |           И   Хар.НаборСвойств В
                                                            |               (ВЫБРАТЬ
                                                            |                   Наб.Ссылка КАК Ссылка
                                                            |               ИЗ
                                                            |                   Справочник.НаборыДополнительныхРеквизитовИСведений КАК Наб
                                                            |               ГДЕ
                                                            |                   Наб.Наименование = &ПринадлежностьНабора))");
        Запрос.УстановитьПараметр("ПолноеНаименование"  , ЗначениеЭлемента);
        Запрос.УстановитьПараметр("ПринадлежностьНабора", МойОбъект.Метаданные().Имя);
        Запрос.УстановитьПараметр("НазваниеРеквизита"   , ИмяЭлемента);
        РезультатЗапроса                                =   Запрос.Выполнить().Выбрать();
        Если
            РезультатЗапроса.Следующий()
        Тогда
            МойТипЗначенияПН                            =   РезультатЗапроса.Ссылка;
        КонецЕсли;
        //Если дополнительного значения нет, то создаём его
        Если
            Не ЗначениеЗаполнено(МойТипЗначенияН)
        И   НЕ ЗначениеЗаполнено(МойТипЗначенияПН)
        Тогда
             МойТипЗначения                             =   Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
             МойТипЗначения.Наименование                =   ЗначениеЭлемента;
             МойТипЗначения.ПолноеНаименование          =   ЗначениеЭлемента;
             МойТипЗначения.Записать();
        Иначе
             МойТипЗначения                             =   ?(ЗначениеЗаполнено(МойТипЗначенияН), МойТипЗначенияН, МойТипЗначенияПН);
        КонецЕсли;
        МойРеквизит.Значение                            =   МойТипЗначения;
    КонецЕсли;
    ЭтоМойОбъект.Записать();
КонецПроцедуры
