Функция ПолучитьEmail(Знач вхФизлицо) Экспорт
    Если
        Строка(ТипЗнч(вхФизлицо))       =   "Сотрудники"
    Тогда
        вхФизлицо                       =   вхФизлицо.ФизическоеЛицо;
    КонецЕсли;
    Запрос                              =   Новый Запрос("ВЫБРАТЬ
                                            |   ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
                                            |ИЗ
                                            |   Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                                            |ГДЕ
                                            |   ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ФизЛицо
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка = &Ссылка");
    Запрос.УстановитьПараметр("Ссылка"  , Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
    Запрос.УстановитьПараметр("ФизЛицо" , вхФизлицо);
    Запрос.УстановитьПараметр("Тип"     , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Результат                           =   Запрос.Выполнить();
    ВыборкаДетальныеЗаписи              =   Результат.Выбрать();
    Пока
        ВыборкаДетальныеЗаписи.Следующий()
    Цикл
        Возврат ВыборкаДетальныеЗаписи.АдресЭП;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции
