Функция ПолучитьEmail(Знач вхФизлицо) Экспорт
    Если
        Строка(ТипЗнч(вхФизлицо))       =   "Сотрудники"
    Тогда
        вхФизлицо                       =   вхФизлицо.ФизическоеЛицо;
    КонецЕсли;
    Запрос                              =   Новый Запрос("ВЫБРАТЬ
                                            |   ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
                                            |ИЗ
                                            |   Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                                            |ГДЕ
                                            |   ФизическиеЛицаКонтактнаяИнформация.Ссылка = &ФизЛицо
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
                                            |   И ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка = &Ссылка");
    Запрос.УстановитьПараметр("Ссылка"  , Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
    Запрос.УстановитьПараметр("ФизЛицо" , вхФизлицо);
    Запрос.УстановитьПараметр("Тип"     , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Результат                           =   Запрос.Выполнить();
    ВыборкаДетальныеЗаписи              =   Результат.Выбрать();
    Пока
        ВыборкаДетальныеЗаписи.Следующий()
    Цикл
        Возврат ВыборкаДетальныеЗаписи.АдресЭП;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

Функция ПолучитьФизлицоПоEmail(Знач email) Экспорт
    Запрос                              =   Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
                                                         |  ФизическиеЛицаКонтактнаяИнформация.Ссылка КАК Ссылка,
                                                         |  ФизическиеЛицаКонтактнаяИнформация.АдресЭП КАК АдресЭП
                                                         |ИЗ
                                                         |  Справочник.ФизическиеЛица.КонтактнаяИнформация КАК ФизическиеЛицаКонтактнаяИнформация
                                                         |ГДЕ
                                                         |  ФизическиеЛицаКонтактнаяИнформация.АдресЭП = &email
                                                         |  И ФизическиеЛицаКонтактнаяИнформация.Тип = &Тип
                                                         |  И ФизическиеЛицаКонтактнаяИнформация.Вид.Ссылка = &EmailФизЛица
                                                         |
                                                         |УПОРЯДОЧИТЬ ПО
                                                         |  ФизическиеЛицаКонтактнаяИнформация.Ссылка.Код УБЫВ");
    Запрос.УстановитьПараметр("EmailФизЛица", Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица);
    Запрос.УстановитьПараметр("email"       , email);
    Запрос.УстановитьПараметр("Тип"         , Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
    Результат                           =   Запрос.Выполнить();
    ВыборкаДетальныеЗаписи              =   Результат.Выбрать();
    Пока
        ВыборкаДетальныеЗаписи.Следующий()
    Цикл
        Возврат ВыборкаДетальныеЗаписи.Ссылка;
    КонецЦикла;
    Возврат Неопределено;
КонецФункции

Функция СписокПользователейПоРолиЧерезГруппыДоступа(НазваниеРоли) Экспорт
    Запрос                              =   Новый Запрос("ВЫБРАТЬ
                                                         |  ГруппыДоступа.Пользователь КАК Пользователь
                                                         |ИЗ
                                                         |  Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступа
                                                         |ГДЕ
                                                         |  ГруппыДоступа.Ссылка.Профиль В
                                                         |          (ВЫБРАТЬ
                                                         |              ПрофилиГруппДоступаРоли.Ссылка КАК Ссылка
                                                         |          ИЗ
                                                         |              Справочник.ПрофилиГруппДоступа.Роли КАК ПрофилиГруппДоступаРоли
                                                         |          ГДЕ
                                                         |              ПрофилиГруппДоступаРоли.Роль.Наименование = &Наименование
                                                         |          ИЛИ ПрофилиГруппДоступаРоли.Роль.Имя = &Наименование)");
    Запрос.УстановитьПараметр("Наименование", НазваниеРоли);
    Возврат Запрос.Выполнить().Выбрать();
КонецФункции
