Функция     Запиши                              (   Событие     ,   Мало        ,   Много = ""      ,   Уровень =   Неопределено        )   Экспорт;
Если                НЕ  ЗначениеЗаполнено       (                                                       Уровень )                   Тогда
        Уровень     =                                                                                   EventLogLevel.Information       ;
КонецЕсли                                                                                                                               ;
        ДТ          =   Формат                  (
                        ТекущаяДатаСеанса       (             ) ,  "ДЛФ = ДВ"                                                          );
        Мало        =                               ДТ          +   Мало                                                                ;
                        ЗаписьЖурналаРегистрации(   Событие                                         ,   Уровень                         ,
                                                                                ,   Много                                               ,
                                                                    Мало                                                               );
                        Сообщить                (                   Мало                                                               );
Возврат                                                             Мало                                                    ;КонецФункции

Функция     ЗапишиОшибку                        (   Событие     ,   Мало = ""   ,   Много = ""      ,   Уровень =   Неопределено        )   Экспорт;
Если                НЕ  ЗначениеЗаполнено       (                                                       Уровень )                   Тогда
        Уровень     =                                                                                   EventLogLevel.Error             ;
КонецЕсли                                                                                                                               ;
        Err         =   ИнформацияОбОшибке      (                                                                                      );
        Err.Причина =                          ?(   Неопределено=   Err.Причина ,   "Неопределено"  ,   Err.Причина                    );
Если                    ЗначениеЗаполнено       (                   Мало                                                                )
Тогда   Мало        =                               Err.Описание+   Мало
Иначе   Мало        =                               Err.Описание                                                                        ;
КонецЕсли                                                                                                                               ;
        ErrTxt      =                                                               Много
                    +                               "Описание           = "     +   Err.Описание    +   Символы.ВК  +   Символы.ПС
                    +                               "Номер строки       = "
                    +   Строка                  (                   Err.НомерСтроки                 +   Символы.ВК  +   Символы.ПС      )
                    +                               "Причина            = "     +   Err.Причина     +   Символы.ВК  +   Символы.ПС      +
                    +                               "Имя модуля         = "     +   Err.ИмяМодуля   +   Символы.ВК  +   Символы.ПС      +
                                                    "Исходная строка    = "     +   Err.ИсходнаяСтрока+ Символы.ВК  +   Символы.ПС      ;
Если                    ЗначениеЗаполнено       (                                   Много                                               )
Тогда   Много       =                               Err.Описание                +   Много
Иначе   Много       =                               Err.Описание                                                                        ;
КонецЕсли                                                                                                                               ;
Возврат                 Запиши                  (   Событие     ,   Мало        ,   Много           ,   Уровень            );КонецФункции

